{
  "education": [
    {
      "awards_achievements": [
        "Scholarship",
        "President’s Level Scholarship (2019 - 2023), Peter Fast Memorial Scholarship (2023), Dean’s List (2019 - 2023)",
        "GPA: 95%"
      ],
      "degree": "Bachelor of Applied Sciences",
      "department": "Electrical and Computer Engineering",
      "duration": "2019-2023",
      "school_name": "University of Windsor"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_BryanFraschetti",
  "highlighted_projects": [
    {
      "description": "Created a cutting-edge web application that leverages Spotify’s API, empowering users with the ability to sort their playlists according to algorithms rooted in music theory. Orchestrated end-to-end development, building server-side middleware with Express and Node that facilitated secure communication and token exchange between a React client and Spotify. Standardized the application using Docker to create a lightweight instance of the app that sequences and uploads playlists in under 500ms.",
      "git_url": "https://github.com/bryanfraschetti/Sequence",
      "name": "Sequence"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Architected set of Bash command line utilities that together provide users with the ability to supervise resource usage across their hosts. Automated process monitoring on many hosts simultaneously by creating cron jobs and facilitated data storage using a containerized Postgres instance inside Docker.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    }
  ],
  "name": "Bryan Fraschetti",
  "others": [
    {
      "bullets": [
        "Avid fan of Formula 1 and soccer",
        "Plays Piano, Guitar, and Trumpet",
        "Enthusiastic about learning languages during my free time",
        "Volunteered to organize a Can Drive and succeeded at collecting almost 30,000 cans for St. Vincent De Paul"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Built and automated applications to support the maintenance of cloud-based infrastructure and assist in load balancing with cron-scheduled Bash scripts. Decentralizing the storage of metrics by creating schema in Postgres and Dockerizing the instance for improved portability and reduced latency. Collaborated in an Agile environment, presenting and sharing my work progress daily.",
      "duration": "May 2024 - present",
      "title": "DevOps Engineer"
    },
    {
      "company": "Quickdraw Tarpaulin Systems",
      "description": "Restructured server-side endpoint architecture to reduce website latency by more than 50%. Leveraged VisTracks’ remote REST APIs using Python to populate MySQL DBs and provide fleet managers with live GPS tracking services for as many as 500 transport trucks. Created an interactive SaaS web application with OpenLayers Maps to display GPS data and aid customers in visualizing and managing their logistics. Amazon Contractors use this service. Spearheaded new authentication and authorization services that implemented HttpOnly cookies and robust sanitization of user input to prevent against XSS and SQL Injection attacks. Configured and daemonized Nginx reverse-proxy server blocks, to automate reliable serving of multiple web apps. Lead the refactoring of codebase",
      "duration": "Jan. 2022 - May 2023",
      "title": "Software Engineer"
    },
    {
      "company": "Advanced Automation Group",
      "description": "Repurposed vehicle back-up cameras to support sensor fusion with mmWave radars, augmenting their existing role and innovating hands-free gesture recognition technologies for opening automotive rear-hatch. Curated application-specific image segmentation and object tracking algorithms for object tracking using OpenCV, NumPy, and xtensor. Utilized Robotic Operating System to transmit live sensor readings between various C++ and Python nodes as well as parallelize and synchronize threads, improving run-time performance by 1.5s. Designed and implemented a TensorFlow based neural network to probabilistically classify gestures, achieving 90% accuracy in real time. Reviewed and validated a pre-publication paper on a linear optimization/support vector machine algorithm that reduced the computation required to identify extreme points.",
      "duration": "Sept. 2020 - Sept. 2023",
      "title": "Software Engineer, Researcher"
    }
  ],
  "skills": {
    "competent": [
      "SQL/MySQL/PSQL",
      "C++",
      "MATLAB",
      "Redis/NoSQL",
      "TensorFlow",
      "Keras",
      "Pandas",
      "React",
      "WSGI",
      "ROS"
    ],
    "familiar": [
      "C#",
      "Scikit-learn",
      "VHDL",
      "Verilog",
      "Logisim"
    ],
    "proficient": [
      "Javascript",
      "Python",
      "Node",
      "Express",
      "Linux/Bash",
      "Docker",
      "OpenCV",
      "Nginx",
      "NumPy",
      "Git"
    ]
  },
  "summary": "My name is Bryan Fraschetti and I am an Electrical and Computer Engineering graduate who has always been excited about leveraging technology to enhance and improve the lives of others. During my academic studies, I found that I was particularly interested in computer infrastructure and the scalability of services. I have worked as a software engineer, wherein I built web applications with a Javascript/WSGI/MySQL/Nginx tech stack, managed virtual machines and microservices, and automated tasks using Bash, cron, and supervisord. I have also been employed as a Software Engineering researcher where my role was to develop a machine learning system that fused various sensor readings to classify various demonstrated gestures. I am an ambitious learner and diligent employee that is capable of succeeding across a diverse set of tasks."
}
